In [1]:
import pandas as pd

In [2]:
df = pd.read_csv('nba.csv')

In [3]:
df.head()

,Name,Team,Number,Position,Age,Height,Weight,College,Salary
0,Avery Bradley,Boston Celtics,0.0,PG,25.0,6-2,180.0,Texas,7730337.0
1,Jae Crowder,Boston Celtics,99.0,SF,25.0,6-6,235.0,Marquette,6796117.0
2,John Holland,Boston Celtics,30.0,SG,27.0,6-5,205.0,Boston University,NaN
3,R.J. Hunter,Boston Celtics,28.0,SG,22.0,6-5,185.0,Georgia State,1148640.0
4,Jonas Jerebko,Boston Celtics,8.0,PF,29.0,6-10,231.0,NaN,5000000.0

In [25]:
df.dtypes

Name         object
Team         object
Number      float64
Position     object
Age         float64
Height       object
Weight      float64
College      object
Salary      float64
dtype: object

In [26]:
df['Name'] = df['Name'].astype('str')
df['College'] = df['College'].astype('str')
df['Team'] = df['Team'].astype('str')
df['Position'] = df['Position'].astype('str')
df['Height'] = df['Height'].astype('str')

In [27]:
df['Height'] = df['Height'].str.replace('-', "'")

In [29]:
df['Number'] = df['Number'].astype(int)

In [30]:
df.head()

,Name,Team,Number,Position,Age,Height,Weight,College,Salary
0,Avery Bradley,Boston Celtics,0,PG,25.0,6'2,180.0,Texas,7.730337e+06
1,Jae Crowder,Boston Celtics,99,SF,25.0,6'6,235.0,Marquette,6.796117e+06
2,John Holland,Boston Celtics,30,SG,27.0,6'5,205.0,Boston University,4.842684e+06
3,R.J. Hunter,Boston Celtics,28,SG,22.0,6'5,185.0,Georgia State,1.148640e+06
4,Jonas Jerebko,Boston Celtics,8,PF,29.0,6'10,231.0,Kentucky,5.000000e+06

In [37]:
df['Height_cm'] = df['Height'].apply(lambda x : int(x.split("'")[0]) * 30.48 + int(x.split("'")[1]) *2.54)

In [38]:
df.head()

,Name,Team,Number,Position,Age,Height,Weight,College,Salary,Height_cm
0,Avery Bradley,Boston Celtics,0,PG,25.0,6'2,180.0,Texas,7.730337e+06,187.96
1,Jae Crowder,Boston Celtics,99,SF,25.0,6'6,235.0,Marquette,6.796117e+06,198.12
2,John Holland,Boston Celtics,30,SG,27.0,6'5,205.0,Boston University,4.842684e+06,195.58
3,R.J. Hunter,Boston Celtics,28,SG,22.0,6'5,185.0,Georgia State,1.148640e+06,195.58
4,Jonas Jerebko,Boston Celtics,8,PF,29.0,6'10,231.0,Kentucky,5.000000e+06,208.28

In [4]:
df.describe()

           Number         Age      Weight        Salary
count  457.000000  457.000000  457.000000  4.460000e+02
mean    17.678337   26.938731  221.522976  4.842684e+06
std     15.966090    4.404016   26.368343  5.229238e+06
min      0.000000   19.000000  161.000000  3.088800e+04
25%      5.000000   24.000000  200.000000  1.044792e+06
50%     13.000000   26.000000  220.000000  2.839073e+06
75%     25.000000   30.000000  240.000000  6.500000e+06
max     99.000000   40.000000  307.000000  2.500000e+07

In [6]:
df['Team'].value_counts()

Team
New Orleans Pelicans      19
Memphis Grizzlies         18
New York Knicks           16
Milwaukee Bucks           16
Boston Celtics            15
Brooklyn Nets             15
Portland Trail Blazers    15
Oklahoma City Thunder     15
Denver Nuggets            15
Washington Wizards        15
Miami Heat                15
Charlotte Hornets         15
Atlanta Hawks             15
San Antonio Spurs         15
Houston Rockets           15
Dallas Mavericks          15
Indiana Pacers            15
Detroit Pistons           15
Cleveland Cavaliers       15
Chicago Bulls             15
Sacramento Kings          15
Phoenix Suns              15
Los Angeles Lakers        15
Los Angeles Clippers      15
Golden State Warriors     15
Toronto Raptors           15
Philadelphia 76ers        15
Utah Jazz                 15
Orlando Magic             14
Minnesota Timberwolves    14
Name: count, dtype: int64

In [7]:
df.isnull().sum()

Name         1
Team         1
Number       1
Position     1
Age          1
Height       1
Weight       1
College     85
Salary      12
dtype: int64

In [18]:
df['College'].mode()

0    Kentucky
Name: College, dtype: object

In [13]:
df['College'] = df['College'].fillna(df['College'].mode()[0])

In [14]:
df.isnull().sum()

Name         1
Team         1
Number       1
Position     1
Age          1
Height       1
Weight       1
College      0
Salary      12
dtype: int64

In [15]:
df['College'].value_counts()

College
Kentucky           107
Duke                20
Kansas              18
North Carolina      16
UCLA                15
                  ...
Utah Valley          1
Cleveland State      1
Iowa State           1
Florida State        1
Baylor               1
Name: count, Length: 118, dtype: int64

In [20]:
df['Salary'] = df['Salary'].fillna(df['Salary'].mean())

In [21]:
df.isnull().sum()

Name        1
Team        1
Number      1
Position    1
Age         1
Height      1
Weight      1
College     0
Salary      0
dtype: int64

In [22]:
df.dropna(inplace = True)

In [24]:
df.isnull().sum()

Name        0
Team        0
Number      0
Position    0
Age         0
Height      0
Weight      0
College     0
Salary      0
dtype: int64

In [39]:
df.ndim

2

In [40]:
df.shape

(457, 10)

In [41]:
from sklearn.preprocessing import LabelEncoder

In [43]:
le = LabelEncoder()

In [44]:
df['College'] = le.fit_transform(df['College'])

In [47]:
df.head()

,Name,Team,Number,Position,Age,Height,Weight,College,Salary,Height_cm
0,Avery Bradley,Boston Celtics,0,PG,25.0,6'2,180.0,93,7.730337e+06,187.96
1,Jae Crowder,Boston Celtics,99,SF,25.0,6'6,235.0,52,6.796117e+06,198.12
2,John Holland,Boston Celtics,30,SG,27.0,6'5,205.0,8,4.842684e+06,195.58
3,R.J. Hunter,Boston Celtics,28,SG,22.0,6'5,185.0,33,1.148640e+06,195.58
4,Jonas Jerebko,Boston Celtics,8,PF,29.0,6'10,231.0,45,5.000000e+06,208.28

In [46]:
le.inverse_transform(df['College'])

array(['Texas', 'Marquette', 'Boston University', 'Georgia State',
       'Kentucky', 'Kentucky', 'LSU', 'Gonzaga', 'Louisville',
       'Oklahoma State', 'Ohio State', 'Washington', 'Ohio State',
       'Kentucky', 'North Carolina', 'Kentucky', 'Oklahoma State',
       'North Carolina', 'Arizona', 'Georgia Tech', 'Kentucky',
       'Cincinnati', 'Miami (FL)', 'Stanford', 'Syracuse', 'Saint Louis',
       'Kansas', 'Georgetown', 'Texas A&M', 'Georgia Tech', 'UCLA',
       'UNLV', 'Kentucky', 'Syracuse', 'Kentucky', 'Wichita State',
       "Saint Joseph's", 'Notre Dame', 'Stanford', 'Norfolk State',
       'Kentucky', 'Kentucky', 'Duke', 'Kentucky', 'Arizona',
       'Washington', 'Duke', 'Murray State', 'Tennessee State', 'Kansas',
       'Syracuse', 'Bowling Green', 'Purdue', 'North Carolina', 'Arizona',
       'Kentucky', 'Duke', 'Wake Forest', 'Michigan', 'Georgetown',
       'UNLV', 'Kentucky', 'Kentucky', 'Missouri', 'USC', 'Wake Forest',
       'Texas', 'Villanova', 'Kentucky', 'Kentucky', 'UCLA', 'Washington',
       'Kentucky', 'Rider', 'Kentucky', 'Utah', 'Kentucky',
       'North Carolina', 'Utah', 'Belmont', 'Davidson', 'Vanderbilt',
       'Michigan State', 'Arizona', 'Kentucky', 'UCLA', 'North Carolina',
       'Kansas', 'Florida', 'Washington State', 'Kentucky', 'Kansas',
       'Arizona State', 'Michigan', 'Michigan State', 'Georgetown',
       'Oklahoma', 'Syracuse', 'Texas A&M', 'UCLA', 'Wake Forest',
       'Kansas', 'Kentucky', 'Duke', 'Duke', 'Washington', 'LSU',
       'Kansas', 'Stanford', 'Kentucky', 'Missouri', 'Georgetown',
       'Kentucky', 'Duke', 'Wyoming', 'Kentucky', 'Ohio State', 'Gonzaga',
       'Kentucky', "St. John's", 'USC', 'Kentucky', 'Kentucky', 'Arizona',
       'Kentucky', 'Kentucky', 'Vanderbilt', 'Kentucky', 'Maryland',
       'Wisconsin', 'Missouri', 'Utah Valley', 'Kentucky', 'Texas',
       'North Carolina State', 'UC Santa Barbara', 'Baylor',
       'Oklahoma State', 'Kentucky', 'Connecticut', 'Kentucky',
       'Kentucky', 'UCLA', 'Kentucky', 'Duke', 'Wisconsin', 'Connecticut',
       'Ohio State', 'Kansas', 'Oregon State', 'Kentucky', 'New Mexico',
       'Oregon', 'Marquette', 'Duke', 'Kentucky', 'Kentucky', 'USC',
       'Washington', 'Creighton', 'Kentucky', 'Purdue', 'Florida',
       'Arkansas', 'Memphis', 'New Mexico', "Saint Mary's", 'Arizona',
       'Duke', 'Kentucky', 'Arizona', 'Duke', 'Miami (FL)', 'Kansas',
       'UCLA', 'Tennessee', 'Kentucky', 'Georgia Tech', 'Kentucky',
       'Texas', 'Alabama', 'UNLV', 'Washington State', 'Maryland',
       'North Carolina State', 'North Carolina', 'Georgia', 'Colorado',
       'Connecticut', 'Tennessee', 'Villanova', 'Boston College',
       'Arizona', 'Kentucky', 'Kansas', 'Creighton', 'Temple', 'Syracuse',
       'Kentucky', 'Fresno State', 'IUPUI', 'Arizona', 'Arizona',
       'North Carolina', 'Kentucky', 'Kentucky', 'Michigan',
       'Eastern Washington', 'Texas', 'Western Michigan', 'Oregon',
       'Kentucky', 'Arizona', 'Syracuse', 'Oregon State', 'Syracuse',
       'North Carolina', 'Kentucky', 'USC', 'Texas A&M', 'Georgetown',
       'Marquette', 'LSU', 'Duke', 'Duke', 'Maryland', 'UNLV', 'Virginia',
       'Northeastern', 'Western Kentucky', 'North Carolina', 'Wisconsin',
       'Florida', 'Marquette', 'Nevada', 'Kentucky', 'Kentucky',
       'Kentucky', 'Florida', 'Stanford', 'Connecticut', 'Illinois',
       'UCLA', 'Kansas State', 'Arkansas', 'Florida', 'Kentucky',
       'Wisconsin', 'Charleston', 'Arizona State', 'Louisville',
       'Kentucky', 'Kentucky', 'Clemson', 'Kentucky', 'Kentucky',
       'Arizona', 'UCLA', 'Oklahoma State', 'Blinn College', 'UCLA',
       'North Carolina', 'Ohio State', 'Providence', 'UCLA', 'Kentucky',
       'Alabama', 'North Carolina', 'LSU', 'Detroit', 'Rhode Island',
       'Michigan State', 'Cincinnati', 'USC', 'North Carolina',
       'Kentucky', 'California', 'Kentucky', 'Nevada', 'Cleveland State',
       'Villanova', 'Kentucky', 'Iowa State', 'Florida State',
       'Long Beach State', 'Memphis', 'Penn State', 'Alabama', 'Indiana',
       'Texas', 'UCLA', 'UC Santa Barbara', 'Kentucky', 'Washington',
       'Texas', 'UCLA', 'Florida', 'Kentucky', 'Wake Forest', 'Kentucky',
       'North Carolina', 'San Diego State', 'Kentucky',
       'Western Carolina', 'Utah', "Saint Mary's", 'Kentucky', 'Houston',
       'Xavier', 'Old Dominion', 'Michigan', 'Kansas', 'Florida',
       'Minnesota', 'Creighton', 'Louisiana Tech', 'Bucknell',
       'Pittsburgh', 'Kentucky', 'Virginia', 'Kentucky', 'Kentucky',
       'Kentucky', 'Wake Forest', 'Kentucky', 'Virginia Commonwealth',
       'California', 'North Carolina', 'Kentucky', 'Washington',
       'Kentucky', 'Wisconsin', 'Kentucky', 'Connecticut',
       'Western Kentucky', 'Harvard', 'Connecticut', 'North Carolina',
       'Indiana', 'Georgia Tech', 'Duke', 'Kentucky', 'Kentucky',
       'Florida', 'Arkansas', 'Fresno State', 'Duke', 'Tennessee',
       'Kentucky', 'Marquette', 'Virginia Commonwealth', 'Marshall',
       'Duke', 'Kentucky', 'USC', 'Kentucky', 'Arizona', 'Kentucky',
       'Kentucky', 'Kentucky', 'Iowa', 'Connecticut', 'St. Bonaventure',
       'Indiana', 'Louisiana-Lafayette', 'Colorado State', 'USC',
       'Tennessee', 'Michigan State', 'Florida', 'Boston College',
       'Virginia Tech', 'Kansas', 'Kentucky', 'North Carolina State',
       'Kentucky', 'Kansas', 'Kansas', 'Georgetown', 'Nevada', 'LSU',
       'LSU', 'Kentucky', 'Kansas', 'Texas', 'Memphis', 'DePaul',
       'Morehead State', 'Kentucky', 'Michigan State', 'Kentucky',
       'Kentucky', 'Florida', 'Kentucky', "Saint Joseph's", 'Kentucky',
       "St. John's", 'Kentucky', 'Kentucky', 'Louisville', 'Kentucky',
       'Duke', 'UCLA', 'UCLA', 'Michigan State', 'Kentucky', 'Kentucky',
       'Kentucky', 'Kentucky', 'Fresno State', 'Kentucky', 'Kansas',
       'Pittsburgh', 'Kansas', 'Texas', 'Villanova', 'Stanford',
       'Kentucky', 'Kentucky', 'Michigan', 'Kentucky', 'Georgia Tech',
       'Murray State', 'Colorado', 'Duke', 'Syracuse', 'UCLA', 'Kansas',
       'Wake Forest', 'Notre Dame', 'California', 'North Carolina',
       "St. John's", 'Duke', 'Central Michigan', 'Illinois',
       'Weber State', 'Lehigh', 'Westchester CC', 'Duke', 'Dayton',
       'Indiana', 'Clemson', 'Michigan', 'Colorado', 'Kentucky',
       'Georgia Tech', 'Kentucky', 'Butler', 'Duke', 'Kentucky', 'Dayton',
       'Kentucky', 'Butler', 'Kentucky', 'Kentucky', 'Kansas'],
      dtype=object)